{
    "projects": [
        {
            "title": "Evernote",
            "description": [
                "The responsive Evernote homepage redesign is built to support 26 languages. The homepage was built to help optimize user sign ups and help users understand how Evernote is a great workspace. The modular homepage was built using SASS, jQuery, HTML5 and Grunt."
            ],
            "url": "http://evernote.com",
            "thumbnail": "evernote.jpg",
            "images": [
                "evernote1.jpg",
                "evernote2.jpg",
                "evernote3.jpg",
                "evernote4.jpg",
                "evernote5.jpg"
            ],
            "alt": [
                "Evernote homepage desktop",
                "Evernote homepage tablet",
                "Evernote homepage mobile"
            ],
            "classes": [
                "desktop",
                "tablet",
                "mobile",
                "desktop",
                "desktop"
            ]
        },
        {
            "title": "Evernote Business",
            "description": [
                "The responsive Evernote Business homepage was is built to support 26 languages. The modular page was built using SASS, jQuery, HTML5, SVG and Grunt."
            ],
            "url": "http://evernote.com/business",
            "thumbnail": "evernote-business.jpg",
            "images": [
                "evernote-business1.jpg",
                "evernote-business2.jpg",
                "evernote-business3.jpg"
            ],
            "alt": [
                "Evernote Business homepage desktop",
                "Evernote Business homepage tablet",
                "Evernote Business mobile"
            ],
            "classes": [
                "desktop",
                "tablet",
                "mobile"
            ]
        },
        {
            "title": "Walmart",
            "description": [
                "This project was to re-architect and redesign Walmart.ca using the Typesafe Reactive platform on top of Endeca/Oracle Commerce into a fully responsive, cartridge driven, and highly customizable e-Commerce site that enables Walmart to grow their online business. The new Walmart.ca was built using the Play MVC framework and the Scala and Akka languages on the back-end, and on the front-end the responsive UI was constructed using HTML5, CSS3, jQuery, RequireJS, {Less} CSS framework, and the KnockoutJS MVVM framework."
            ],
            "url": "http://walmart.ca",
            "thumbnail": "walmart.jpg",
            "images": [
                "walmart1.jpg",
                "walmart2.jpg",
                "walmart3.jpg",
                "walmart4.jpg"
            ],
            "alt": [
                "Walmart homepage on desktop",
                "Walmart product page on desktop",
                "Walmart product page on tablet",
                "Walmart product page on mobile"
            ],
            "classes": [
                "desktop",
                "desktop",
                "tablet",
                "mobile"
            ]
        },
        {
            "title": "Senses Lost",
            "description": [
                "Senses Lost is a passion project that I created in 2005 during my spare time. The website focuses on Canadian graffiti and street art culture. Senses Lost contains a daily updated blog, interviews with graffiti artists, product reviews, and a large selection of pictures, featuring work from over 150 graffiti artists from across USA and Canada.",
                "I created the website as a way to gain experience with the concept of using Wordpress as a content management system and get a betting understanding for search engine optimization. Additionally, I designed both the logo and the custom template for the website. Once I started adding posts, the unique visitors kept growing each day. People have continued to show their interest in the website, increasing the traffic each Month.",
                "Senses Lost has been a project that I’ve been passionate about and have continued to work on ever since."
            ],
            "url": "http://senseslost.com",
            "thumbnail": "senseslost.jpg",
            "images": [
                "senseslost1.jpg",
                "senseslost2.jpg"
            ],
            "alt": [
                "Senses Lost homepage desktop",
                "Senses Lost article page tablet",
                "Senses Lost homepage mobile"
            ],
            "classes": [
                "desktop",
                "tablet",
                "mobile"
            ]
        },
        {
            "title": "CIBC Kiosk",
            "description": [
                "CIBC's Future Branch is a web-based kiosk that's currently being used in their branches to help promote products and services. The kiosk runs on laptops, iPads and large touch screen TV. As the lead developer on the project I worked with a team of our front end developers to architect and build the working solution. Using responsive design and JavaScript frameworks we were able to create a successful kiosk solution for CIBC."
            ],
            "url": "",
            "thumbnail": "cibc-kiosk.jpg",
            "images": [
                "cibc-kiosk1.jpg",
                "cibc-kiosk2.jpg"
            ],
            "alt": [
                "",
                ""
            ],
            "classes": [
                "desktop",
                "desktop"
            ]
        },
        {
            "title": "Bottle Drive",
            "description": [
                "Bottle Drive was a pro bono website CGI donated to Returns For Leukemia fundraiser. Held each May by United Food and Commercial Workers Local 12R24 in partnership with The Beer Store to raise funds for The Leukemia and Lymphoma Society of Canada.",
                "In order to help raise awareness and allow volunteers to easily sign up we designed and created a brand new website for the fundraiser. Originally the organizers kept track of volunteers through an Excel spreadsheet. We built an easy to use sign up form for the users as well as an admin panel for the organizers to use to keep track of their volunteers. We also built the site using Wordpress as a CMS to help the organizers with updating content and keeping track of their volunteers.",
                "One of the best features was the ability for the volunteers to have the ability to find the closest Beer Store to their location to volunteer at. Each location also provided the information as to how many people had already signed up to volunteer at that particular store. This made volunteer sign up really handy for both the volunteers and the organizers.",
                "Returns For Leukemia organizers were extremely happy with what we put together and have found it easier to get more volunteers, as well as raise even more money."
            ],
            "url": "http://bottledrive.ca",
            "thumbnail": "bottledrive.jpg",
            "images": [
                "bottledrive1.jpg",
                "bottledrive2.jpg",
                "bottledrive3.jpg"
            ],
            "alt": [
                "Bottle Drive homepage",
                "Bottle Drive volunteer map",
                "Bottle Drive volunteer form"
            ],
            "classes": [
                "desktop",
                "desktop",
                "desktop"
            ]
        },
        {
            "title": "CIBC Mobile",
            "description": [
                "CIBC wanted to create a mobile version of their desktop website. As the lead developer on the project I worked with a team of developers to implement the mobile website for Blackberry, Android, iPhone and Windows devices. We leveraged media-queries to handle portrait and landscape layouts on the various mobile devices. Our team also took advantage of the Retina display on the iPhone 4 and optimized our images for the HD screen."
            ],
            "url": "",
            "thumbnail": "cibc-mobile.jpg",
            "images": [
                "cibc-mobile-1.jpg",
                "cibc-mobile-2.jpg",
                "cibc-mobile-3.jpg",
                "cibc-mobile-4.jpg"
            ],
            "alt": [
                "",
                ""
            ],
            "classes": [
                "desktop",
                "desktop",
                "desktop",
                "desktop"
            ]
        },
        {
            "title": "TELUS",
            "description": [
                "For the TELUS project I worked with two other developers to create a promotional website for small businesses. The website acts a portal for their costumers to choose and change services to fit their business needs. The plans and pricing vary from the person’s location, which they choose in order for the prices to appear.",
                "The website was created using HTML5, CSS3, JQuery, and XML. We leveraged the JavaScript framework jStorage to be able to use localstorage for all browsers. We supported the browsers IE6, IE7, IE8, IE9, Chrome, Firefox and Safari."
            ],
            "url": "",
            "thumbnail": "telus.jpg",
            "images": [
                "telus-1.jpg",
                "telus-2.jpg",
                "telus-3.jpg"
            ],
            "alt": [
                "",
                ""
            ],
            "classes": [
                "desktop",
                "desktop",
                "desktop"
            ]
        }
    ],
    "tools": [
        {
            "title": "Grunt Unused",
            "description": [
                "A Grunt task to check for unused files (jpg, png, css, js etc) in a project files and output them to the console."
            ],
            "url": "https://github.com/ryanburgess/grunt-unused",
            "thumbnail": ""
        },
        {
            "title": "Grunt JSON Pretty",
            "description": [
                "A Grunt task to help clean up the formatting of your JSON files. The task will also generate a minified JSON version of each file."
            ],
            "url": "https://github.com/ryanburgess/grunt-json-pretty",
            "thumbnail": ""
        },
        {
            "title": "Sass Useful Mixins",
            "description": [
                "A collection of useful SASS mixins. These mixins should help speed up your development process. The file includes SASS mixins for REM unit fallback support, Retina Images, Breakpoints, Animations, Transitions, Linear Gradients, Rounded Corners, Opacity, Clearfix, Hide text, Triangles/Arrows and more."
            ],
            "url": "https://github.com/ryanburgess/SASS-Useful-Mixins",
            "thumbnail": ""
        }
    ],
    "talks": [
        {
            "title": "Websites &amp; Frameworks: Web at Evernote",
            "description": [
                "A presentation given at Evernote's annual conference in San Francisco. The presentation gives insights into some of the front end technologies leveraged at Evernote (Grunt, Gulp, JavaScript, Node.js, Sass). Find out how Evernote handles multiple websites in 26 languages."
            ],
            "video": "xNGLdMyYh8c",
            "slides": "42199598",
            "thumbnail": ""
        },
        {
            "title": "10 tips for making your code more accessible",
            "description": [
                "This was a presentation I put together for a talk I gave to Front End Engineers to help meet better accessiblity standards."
            ],
            "video": "",
            "slides": "",
            "thumbnail": ""
        }
    ],
    "about": {
        "title": "About",
        "social": [
            {
                "title": "Github",
                "class": "github",
                "url": "https://github.com/ryanburgess"
            },
            {
                "title": "Twitter",
                "class": "twitter",
                "url": "https://twitter.com/burgessdryan"
            },
            {
                "title": "LinkedIn",
                "class": "linkedin",
                "url": "https://www.linkedin.com/in/ryanburgess"
            }
        ],
        "description": [
            "Ryan Burgess is a Manager, UI Engineering at Netflix in California. Throughout his years of experience he has obtained a great deal of knowledge working for internal and external clients delivering web and mobile applications. He has a extensive experience working with HTML5, CSS3, SASS, LESS, Responsive Design, JQuery, JavaScript, AngularJS, BackboneJS, NodeJS, Mobile, PHP, MySQL, ActionScript 3 and the Adobe Creative Suite."
        ]
    }
}